andreili/reprap_stm/rep_stm32.ioc
#MicroXplorer Configuration settings - do not modify
#Mon Nov 10 08:49:31 GMT+03:00 2014
File.Version=1
KeepUserPlacement=false
Mcu.Family=STM32F1
Mcu.IP0=ADC1
Mcu.IP1=ADC2
Mcu.IP10=USART3
Mcu.IP11=USB
Mcu.IP2=ADC3
Mcu.IP3=I2C1
Mcu.IP4=SYS
Mcu.IP5=TIM1
Mcu.IP6=TIM2
Mcu.IP7=TIM3
Mcu.IP8=TIM4
Mcu.IP9=USART2
Mcu.IPNb=12
Mcu.Name=STM32F103V(C-D-E)Tx
Mcu.Package=LQFP100
Mcu.Pin0=PE2
Mcu.Pin1=PE3
Mcu.Pin10=PC2
Mcu.Pin11=PC3
Mcu.Pin12=PA0-WKUP
Mcu.Pin13=PA1
Mcu.Pin14=PA2
Mcu.Pin15=PA3
Mcu.Pin16=PA4
Mcu.Pin17=PA5
Mcu.Pin18=PA6
Mcu.Pin19=PA7
Mcu.Pin2=PE4
Mcu.Pin20=PC4
Mcu.Pin21=PC5
Mcu.Pin22=PB0
Mcu.Pin23=PB1
Mcu.Pin24=PB2
Mcu.Pin25=PE7
Mcu.Pin26=PE8
Mcu.Pin27=PE9
Mcu.Pin28=PE10
Mcu.Pin29=PE11
Mcu.Pin3=PE5
Mcu.Pin30=PE12
Mcu.Pin31=PE13
Mcu.Pin32=PE14
Mcu.Pin33=PE15
Mcu.Pin34=PB10
Mcu.Pin35=PB11
Mcu.Pin36=PB12
Mcu.Pin37=PB14
Mcu.Pin38=PB15
Mcu.Pin39=PD8
Mcu.Pin4=PE6
Mcu.Pin40=PD9
Mcu.Pin41=PD10
Mcu.Pin42=PD11
Mcu.Pin43=PD12
Mcu.Pin44=PD13
Mcu.Pin45=PD14
Mcu.Pin46=PD15
Mcu.Pin47=PC6
Mcu.Pin48=PC7
Mcu.Pin49=PC8
Mcu.Pin5=PC13-TAMPER-RTC
Mcu.Pin50=PC9
Mcu.Pin51=PA8
Mcu.Pin52=PA9
Mcu.Pin53=PA10
Mcu.Pin54=PA11
Mcu.Pin55=PA12
Mcu.Pin56=PA13
Mcu.Pin57=PA14
Mcu.Pin58=PA15
Mcu.Pin59=PC10
Mcu.Pin6=PC14-OSC32_IN
Mcu.Pin60=PC11
Mcu.Pin61=PC12
Mcu.Pin62=PD0
Mcu.Pin63=PD1
Mcu.Pin64=PD2
Mcu.Pin65=PD3
Mcu.Pin66=PD4
Mcu.Pin67=PD5
Mcu.Pin68=PD6
Mcu.Pin69=PD7
Mcu.Pin7=PC15-OSC32_OUT
Mcu.Pin70=PB3
Mcu.Pin71=PB4
Mcu.Pin72=PB5
Mcu.Pin73=PB6
Mcu.Pin74=PB7
Mcu.Pin75=PB8
Mcu.Pin76=PB9
Mcu.Pin77=PE0
Mcu.Pin78=PE1
Mcu.Pin8=PC0
Mcu.Pin9=PC1
Mcu.PinsNb=79
Mcu.UserName=STM32F103VETx
PA0-WKUP.GPIOParameters=GPIO_Label,GPIO_Mode
PA0-WKUP.GPIO_Label=AIN 1
PA0-WKUP.GPIO_Mode=GPIO_Mode_AIN
PA0-WKUP.Mode=IN0
PA0-WKUP.Signal=ADC1_IN0
PA1.GPIOParameters=GPIO_Label,GPIO_Mode
PA1.GPIO_Label=AIN 2
PA1.GPIO_Mode=GPIO_Mode_AIN
PA1.Mode=IN1
PA1.Signal=ADC1_IN1
PA10.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PA10.GPIO_Label=OUT6
PA10.GPIO_Mode=GPIO_Mode_Out_PP
PA10.GPIO_Speed=GPIO_Speed_2MHz
PA10.Locked=true
PA10.Signal=GPIO_Output
PA11.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PA11.GPIO_Label=DM
PA11.GPIO_Mode=
PA11.GPIO_Speed=GPIO_Speed_50MHz
PA11.Mode=Dummy
PA11.Signal=USB_DM
PA12.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PA12.GPIO_Label=DP
PA12.GPIO_Mode=
PA12.GPIO_Speed=GPIO_Speed_50MHz
PA12.Mode=Dummy
PA12.Signal=USB_DP
PA13.Locked=true
PA13.Mode=Serial-Wire
PA13.Signal=SYS_JTMS-SWDIO
PA14.Locked=true
PA14.Mode=Serial-Wire
PA14.Signal=SYS_JTCK-SWCLK
PA15.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PA15.GPIO_Label=Encoder 2, A
PA15.GPIO_Mode=
PA15.GPIO_Speed=GPIO_Speed_2MHz
PA15.Locked=true
PA15.Mode=Encoder-Interface
PA15.Signal=TIM2_CH1_ETR
PA2.GPIOParameters=GPIO_Speed,GPIO_Mode
PA2.GPIO_Mode=GPIO_Mode_Out_PP
PA2.GPIO_Speed=GPIO_Speed_2MHz
PA2.Locked=true
PA2.Signal=GPIO_Output
PA3.GPIOParameters=GPIO_Speed,GPIO_Mode
PA3.GPIO_Mode=GPIO_Mode_Out_PP
PA3.GPIO_Speed=GPIO_Speed_2MHz
PA3.Locked=true
PA3.Signal=GPIO_Output
PA4.Mode=IN4
PA4.Signal=ADC2_IN4
PA5.GPIOParameters=GPIO_Label,GPIO_Mode
PA5.GPIO_Label=AIN 6
PA5.GPIO_Mode=GPIO_Mode_AIN
PA5.Mode=IN5
PA5.Signal=ADC2_IN5
PA6.GPIOParameters=GPIO_Speed,GPIO_Mode
PA6.GPIO_Mode=GPIO_Mode_Out_PP
PA6.GPIO_Speed=GPIO_Speed_2MHz
PA6.Locked=true
PA6.Signal=GPIO_Output
PA7.GPIOParameters=GPIO_Speed,GPIO_Mode
PA7.GPIO_Mode=GPIO_Mode_Out_PP
PA7.GPIO_Speed=GPIO_Speed_2MHz
PA7.Locked=true
PA7.Signal=GPIO_Output
PA8.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PA8.GPIO_Label=Encoder 1, A
PA8.GPIO_Mode=
PA8.GPIO_Speed=GPIO_Speed_2MHz
PA8.Locked=true
PA8.Mode=Encoder-Interface
PA8.Signal=TIM1_CH1
PA9.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PA9.GPIO_Label=Encoder 1, B
PA9.GPIO_Mode=
PA9.GPIO_Speed=GPIO_Speed_2MHz
PA9.Locked=true
PA9.Mode=Encoder-Interface
PA9.Signal=TIM1_CH2
PB0.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PB0.GPIO_Label=Drive 1, MS0
PB0.GPIO_Mode=GPIO_Mode_Out_PP
PB0.GPIO_Speed=GPIO_Speed_2MHz
PB0.Locked=true
PB0.Signal=GPIO_Output
PB1.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PB1.GPIO_Label=Drive 1, MS1
PB1.GPIO_Mode=GPIO_Mode_Out_PP
PB1.GPIO_Speed=GPIO_Speed_2MHz
PB1.Locked=true
PB1.Signal=GPIO_Output
PB10.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PB10.GPIO_Label=Slave TX
PB10.GPIO_Mode=
PB10.GPIO_Speed=GPIO_Speed_2MHz
PB10.Mode=Asynchronous
PB10.Signal=USART3_TX
PB11.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PB11.GPIO_Label=Slave RX
PB11.GPIO_Mode=
PB11.GPIO_Speed=GPIO_Speed_2MHz
PB11.Mode=Asynchronous
PB11.Signal=USART3_RX
PB12.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PB12.GPIO_Label=Drive5 , Enable
PB12.GPIO_Mode=GPIO_Mode_Out_PP
PB12.GPIO_Speed=GPIO_Speed_2MHz
PB12.Locked=true
PB12.Signal=GPIO_Output
PB14.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PB14.GPIO_Label=USB Enable
PB14.GPIO_Mode=GPIO_Mode_Out_PP
PB14.GPIO_Speed=GPIO_Speed_2MHz
PB14.Locked=true
PB14.Signal=GPIO_Output
PB15.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PB15.GPIO_Label=Drive 5, Step
PB15.GPIO_Mode=GPIO_Mode_Out_PP
PB15.GPIO_Speed=GPIO_Speed_2MHz
PB15.Locked=true
PB15.Signal=GPIO_Output
PB2.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PB2.GPIO_Label=Drive 1, MS2
PB2.GPIO_Mode=GPIO_Mode_Out_PP
PB2.GPIO_Speed=GPIO_Speed_2MHz
PB2.Locked=true
PB2.Signal=GPIO_Output
PB3.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PB3.GPIO_Label=Encoder 2, B
PB3.GPIO_Mode=
PB3.GPIO_Speed=GPIO_Speed_2MHz
PB3.Locked=true
PB3.Mode=Encoder-Interface
PB3.Signal=TIM2_CH2
PB4.GPIOParameters=GPIO_Label,GPIO_Mode
PB4.GPIO_Label=IN 1
PB4.GPIO_Mode=GPIO_Mode_IPU
PB4.Locked=true
PB4.Signal=GPIO_Input
PB5.GPIOParameters=GPIO_Label,GPIO_Mode
PB5.GPIO_Label=IN 2
PB5.GPIO_Mode=GPIO_Mode_IPU
PB5.Locked=true
PB5.Signal=GPIO_Input
PB6.Mode=I2C
PB6.Signal=I2C1_SCL
PB7.Mode=I2C
PB7.Signal=I2C1_SDA
PB8.GPIOParameters=GPIO_Label,GPIO_Mode
PB8.GPIO_Label=IN 3
PB8.GPIO_Mode=GPIO_Mode_IPU
PB8.Locked=true
PB8.Signal=GPIO_Input
PB9.GPIOParameters=GPIO_Label,GPIO_Mode
PB9.GPIO_Label=IN 4
PB9.GPIO_Mode=GPIO_Mode_IPU
PB9.Locked=true
PB9.Signal=GPIO_Input
PC0.GPIOParameters=GPIO_Label,GPIO_Mode
PC0.GPIO_Label=AIN 9
PC0.GPIO_Mode=GPIO_Mode_AIN
PC0.Mode=IN10
PC0.Signal=ADC3_IN10
PC1.GPIOParameters=GPIO_Label,GPIO_Mode
PC1.GPIO_Label=AIN 10
PC1.GPIO_Mode=GPIO_Mode_AIN
PC1.Mode=IN11
PC1.Signal=ADC3_IN11
PC10.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PC10.GPIO_Label=OUT 3
PC10.GPIO_Mode=GPIO_Mode_Out_PP
PC10.GPIO_Speed=GPIO_Speed_2MHz
PC10.Locked=true
PC10.Signal=GPIO_Output
PC11.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PC11.GPIO_Label=OUT 4
PC11.GPIO_Mode=GPIO_Mode_Out_PP
PC11.GPIO_Speed=GPIO_Speed_2MHz
PC11.Locked=true
PC11.Signal=GPIO_Output
PC12.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PC12.GPIO_Label=OUT 5
PC12.GPIO_Mode=GPIO_Mode_Out_PP
PC12.GPIO_Speed=GPIO_Speed_2MHz
PC12.Locked=true
PC12.Signal=GPIO_Output
PC13-TAMPER-RTC.GPIOParameters=GPIO_Label,GPIO_Mode
PC13-TAMPER-RTC.GPIO_Label=IN 5
PC13-TAMPER-RTC.GPIO_Mode=GPIO_Mode_IPU
PC13-TAMPER-RTC.Locked=true
PC13-TAMPER-RTC.Signal=GPIO_Input
PC14-OSC32_IN.Locked=true
PC14-OSC32_IN.Signal=SYS_OSC32_IN
PC15-OSC32_OUT.Locked=true
PC15-OSC32_OUT.Signal=SYS_OSC32_OUT
PC2.GPIOParameters=GPIO_Label,GPIO_Mode
PC2.GPIO_Label=IN7
PC2.GPIO_Mode=GPIO_Mode_IPU
PC2.Locked=true
PC2.Signal=GPIO_Input
PC3.GPIOParameters=GPIO_Label,GPIO_Mode
PC3.GPIO_Label=IN8
PC3.GPIO_Mode=GPIO_Mode_IPU
PC3.Locked=true
PC3.Signal=GPIO_Input
PC4.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PC4.GPIO_Label=Drive 1, Dir
PC4.GPIO_Mode=GPIO_Mode_Out_PP
PC4.GPIO_Speed=GPIO_Speed_2MHz
PC4.Locked=true
PC4.Signal=GPIO_Output
PC5.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PC5.GPIO_Label=Drive 1, Step
PC5.GPIO_Mode=GPIO_Mode_Out_PP
PC5.GPIO_Speed=GPIO_Speed_2MHz
PC5.Locked=true
PC5.Signal=GPIO_Output
PC6.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PC6.GPIO_Label=Encoder 3, A
PC6.GPIO_Mode=
PC6.GPIO_Speed=GPIO_Speed_2MHz
PC6.Mode=Encoder-Interface
PC6.Signal=TIM3_CH1
PC7.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PC7.GPIO_Label=Encoder 3, B
PC7.GPIO_Mode=
PC7.GPIO_Speed=GPIO_Speed_2MHz
PC7.Mode=Encoder-Interface
PC7.Signal=TIM3_CH2
PC8.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PC8.GPIO_Label=OUT 1
PC8.GPIO_Mode=GPIO_Mode_Out_PP
PC8.GPIO_Speed=GPIO_Speed_2MHz
PC8.Locked=true
PC8.Signal=GPIO_Output
PC9.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PC9.GPIO_Label=OUT 2
PC9.GPIO_Mode=GPIO_Mode_Out_PP
PC9.GPIO_Speed=GPIO_Speed_2MHz
PC9.Locked=true
PC9.Signal=GPIO_Output
PCC.Battery=Li-MnO2(CR2032)
PCC.Battery.Capacity=225.0
PCC.Battery.Compatibility=Yes
PCC.Battery.InParallel=1
PCC.Battery.InSeries=1
PCC.Battery.MaxContinuous=3.0
PCC.Battery.MaxPulseCurrent=15.0
PCC.Battery.NominalVoltage=3.0
PCC.Battery.SelfDischarge=0.12
PCC.Family=STM32F4
PCC.MCU=STM32F429Z(E-G-I)Tx
PCC.MXVersion=4.4.0
PCC.PartNumber=STM32F429ZITx
PCC.Seq0=3
PCC.Seq0.Step0.Average_Current=59.6 mA
PCC.Seq0.Step0.CPU_Frequency=180.0 MHz
PCC.Seq0.Step0.DMIPS=225.0
PCC.Seq0.Step0.Duration=1 ms
PCC.Seq0.Step0.Frequency=4.0 MHz
PCC.Seq0.Step0.Memory=RAM/FLASH-ART_ON
PCC.Seq0.Step0.Mode=RUN
PCC.Seq0.Step0.Oscillator=HSE PLL_ON
PCC.Seq0.Step0.Peripherals=CRC FMC GPIOA GPIOB GPIOC GPIOD GPIOE GPIOF GPIOG GPIOH TIM2 TIM3 TIM4 TIM5 USART1 USB_OTG_HS_ULPI WWDG
PCC.Seq0.Step0.User's_Consumption=0 mA
PCC.Seq0.Step0.Vcore=Scale1-High
PCC.Seq0.Step0.Vdd=3.3
PCC.Seq0.Step0.Voltage_Source=Vbus
PCC.Seq0.Step1.Average_Current=59.6 mA
PCC.Seq0.Step1.CPU_Frequency=180.0 MHz
PCC.Seq0.Step1.DMIPS=225.0
PCC.Seq0.Step1.Duration=100 ms
PCC.Seq0.Step1.Frequency=4.0 MHz
PCC.Seq0.Step1.Memory=RAM/FLASH-ART_ON
PCC.Seq0.Step1.Mode=RUN
PCC.Seq0.Step1.Oscillator=HSE PLL_ON
PCC.Seq0.Step1.Peripherals=CRC FMC GPIOA GPIOB GPIOC GPIOD GPIOE GPIOF GPIOG GPIOH TIM2 TIM3 TIM4 TIM5 USART1 USB_OTG_HS_ULPI WWDG
PCC.Seq0.Step1.User's_Consumption=0 mA
PCC.Seq0.Step1.Vcore=Scale1-High
PCC.Seq0.Step1.Vdd=3.3
PCC.Seq0.Step1.Voltage_Source=Vbus
PCC.Seq0.Step2.Average_Current=36.6 mA
PCC.Seq0.Step2.CPU_Frequency=180.0 MHz
PCC.Seq0.Step2.DMIPS=0.0
PCC.Seq0.Step2.Duration=10 ms
PCC.Seq0.Step2.Frequency=4.0 MHz
PCC.Seq0.Step2.Memory=RAM/FLASH
PCC.Seq0.Step2.Mode=SLEEP
PCC.Seq0.Step2.Oscillator=HSE PLL_ON
PCC.Seq0.Step2.Peripherals=CRC FMC GPIOA GPIOB GPIOC GPIOD GPIOE GPIOF GPIOG GPIOH TIM2 TIM3 TIM4 TIM5 USART1 USB_OTG_HS_ULPI WWDG
PCC.Seq0.Step2.User's_Consumption=0 mA
PCC.Seq0.Step2.Vcore=Scale1-High
PCC.Seq0.Step2.Vdd=3.3
PCC.Seq0.Step2.Voltage_Source=Vbus
PCC.SubFamily=STM32F429/439
PCC.Temperature=25
PCC.Vdd=3.3
PD0.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PD0.GPIO_Label=Drive 3, Step
PD0.GPIO_Mode=GPIO_Mode_Out_PP
PD0.GPIO_Speed=GPIO_Speed_2MHz
PD0.Locked=true
PD0.Signal=GPIO_Output
PD1.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PD1.GPIO_Label=Drive 3, Dir
PD1.GPIO_Mode=GPIO_Mode_Out_PP
PD1.GPIO_Speed=GPIO_Speed_2MHz
PD1.Locked=true
PD1.Signal=GPIO_Output
PD10.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PD10.GPIO_Label=Drive 5, MS1
PD10.GPIO_Mode=
PD10.GPIO_Speed=GPIO_Speed_2MHz
PD10.Locked=true
PD10.Signal=GPIO_Output
PD11.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PD11.GPIO_Label=Drive 5, MS2
PD11.GPIO_Mode=
PD11.GPIO_Speed=GPIO_Speed_2MHz
PD11.Locked=true
PD11.Signal=GPIO_Output
PD12.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PD12.GPIO_Label=PWM 1
PD12.GPIO_Mode=GPIO_Mode_Out_PP
PD12.GPIO_Speed=GPIO_Speed_2MHz
PD12.Mode=PWM-Generation
PD12.Signal=TIM4_CH1
PD13.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PD13.GPIO_Label=PWM 2
PD13.GPIO_Mode=GPIO_Mode_Out_PP
PD13.GPIO_Speed=GPIO_Speed_2MHz
PD13.Mode=PWM-Generation
PD13.Signal=TIM4_CH2
PD14.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PD14.GPIO_Label=PWM 3
PD14.GPIO_Mode=GPIO_Mode_Out_PP
PD14.GPIO_Speed=GPIO_Speed_2MHz
PD14.Mode=PWM-Generation
PD14.Signal=TIM4_CH3
PD15.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PD15.GPIO_Label=PWM 4
PD15.GPIO_Mode=GPIO_Mode_Out_PP
PD15.GPIO_Speed=GPIO_Speed_2MHz
PD15.Mode=PWM-Generation
PD15.Signal=TIM4_CH4
PD2.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PD2.GPIO_Label=Drive 3, MS0
PD2.GPIO_Mode=GPIO_Mode_Out_PP
PD2.GPIO_Speed=GPIO_Speed_2MHz
PD2.Locked=true
PD2.Signal=GPIO_Output
PD3.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PD3.GPIO_Label=Drive 3, MS1
PD3.GPIO_Mode=GPIO_Mode_Out_PP
PD3.GPIO_Speed=GPIO_Speed_2MHz
PD3.Locked=true
PD3.Signal=GPIO_Output
PD4.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PD4.GPIO_Label=Drive 3, MS2
PD4.GPIO_Mode=GPIO_Mode_Out_PP
PD4.GPIO_Speed=GPIO_Speed_2MHz
PD4.Locked=true
PD4.Signal=GPIO_Output
PD5.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PD5.GPIO_Label=Master TX
PD5.GPIO_Mode=
PD5.GPIO_Speed=GPIO_Speed_2MHz
PD5.Mode=Asynchronous
PD5.Signal=USART2_TX
PD6.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PD6.GPIO_Label=Master RX
PD6.GPIO_Mode=
PD6.GPIO_Speed=GPIO_Speed_2MHz
PD6.Mode=Asynchronous
PD6.Signal=USART2_RX
PD7.GPIOParameters=GPIO_Label,GPIO_Mode
PD7.GPIO_Label=IN 6
PD7.GPIO_Mode=GPIO_Mode_IPU
PD7.Locked=true
PD7.Signal=GPIO_Input
PD8.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PD8.GPIO_Label=Drive 5, Dir
PD8.GPIO_Mode=
PD8.GPIO_Speed=GPIO_Speed_2MHz
PD8.Locked=true
PD8.Signal=GPIO_Output
PD9.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PD9.GPIO_Label=Drive 5, MS0
PD9.GPIO_Mode=
PD9.GPIO_Speed=GPIO_Speed_2MHz
PD9.Locked=true
PD9.Signal=GPIO_Output
PE0.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PE0.GPIO_Label=Drive 4, MS0
PE0.GPIO_Mode=GPIO_Mode_Out_PP
PE0.GPIO_Speed=GPIO_Speed_2MHz
PE0.Locked=true
PE0.Signal=GPIO_Output
PE1.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PE1.GPIO_Label=Drive 4, MS1
PE1.GPIO_Mode=GPIO_Mode_Out_PP
PE1.GPIO_Speed=GPIO_Speed_2MHz
PE1.Locked=true
PE1.Signal=GPIO_Output
PE10.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PE10.GPIO_Label=Drive 2, MS1
PE10.GPIO_Mode=GPIO_Mode_Out_PP
PE10.GPIO_Speed=GPIO_Speed_2MHz
PE10.Locked=true
PE10.Signal=GPIO_Output
PE11.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PE11.GPIO_Label=Drive 2, MS2
PE11.GPIO_Mode=GPIO_Mode_Out_PP
PE11.GPIO_Speed=GPIO_Speed_2MHz
PE11.Locked=true
PE11.Signal=GPIO_Output
PE12.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PE12.GPIO_Label=Drive 1, Enable
PE12.GPIO_Mode=GPIO_Mode_Out_PP
PE12.GPIO_Speed=GPIO_Speed_2MHz
PE12.Locked=true
PE12.Signal=GPIO_Output
PE13.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PE13.GPIO_Label=Drive2 , Enable
PE13.GPIO_Mode=GPIO_Mode_Out_PP
PE13.GPIO_Speed=GPIO_Speed_2MHz
PE13.Locked=true
PE13.Signal=GPIO_Output
PE14.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PE14.GPIO_Label=Drive 3, Enable
PE14.GPIO_Mode=GPIO_Mode_Out_PP
PE14.GPIO_Speed=GPIO_Speed_2MHz
PE14.Locked=true
PE14.Signal=GPIO_Output
PE15.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PE15.GPIO_Label=Drive 4, Enable
PE15.GPIO_Mode=GPIO_Mode_Out_PP
PE15.GPIO_Speed=GPIO_Speed_2MHz
PE15.Locked=true
PE15.Signal=GPIO_Output
PE2.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PE2.GPIO_Label=Drive 4, MS2
PE2.GPIO_Mode=GPIO_Mode_Out_PP
PE2.GPIO_Speed=GPIO_Speed_2MHz
PE2.Locked=true
PE2.Signal=GPIO_Output
PE3.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PE3.GPIO_Label=Drive 4, Dir
PE3.GPIO_Mode=GPIO_Mode_Out_PP
PE3.GPIO_Speed=GPIO_Speed_2MHz
PE3.Locked=true
PE3.Signal=GPIO_Output
PE4.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PE4.GPIO_Label=Drive 4, Step
PE4.GPIO_Mode=GPIO_Mode_Out_PP
PE4.GPIO_Speed=GPIO_Speed_2MHz
PE4.Locked=true
PE4.Signal=GPIO_Output
PE5.GPIOParameters=GPIO_Label,GPIO_Mode
PE5.GPIO_Label=IN 7
PE5.GPIO_Mode=GPIO_Mode_IPU
PE5.Locked=true
PE5.Signal=GPIO_Input
PE6.GPIOParameters=GPIO_Label,GPIO_Mode
PE6.GPIO_Label=IN 8
PE6.GPIO_Mode=GPIO_Mode_IPU
PE6.Locked=true
PE6.Signal=GPIO_Input
PE7.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PE7.GPIO_Label=Drive 2, Step
PE7.GPIO_Mode=GPIO_Mode_Out_PP
PE7.GPIO_Speed=GPIO_Speed_2MHz
PE7.Locked=true
PE7.Signal=GPIO_Output
PE8.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PE8.GPIO_Label=Drive 2, Dir
PE8.GPIO_Mode=GPIO_Mode_Out_PP
PE8.GPIO_Speed=GPIO_Speed_2MHz
PE8.Locked=true
PE8.Signal=GPIO_Output
PE9.GPIOParameters=GPIO_Speed,GPIO_Label,GPIO_Mode
PE9.GPIO_Label=Drive 2, MS0
PE9.GPIO_Mode=GPIO_Mode_Out_PP
PE9.GPIO_Speed=GPIO_Speed_2MHz
PE9.Locked=true
PE9.Signal=GPIO_Output
